#+STARTUP: inlineimages
*** Ejemplo 1 - Condicional Simple y la funciones (>) y (message)
  #+BEGIN_SRC elisp
    ;; el (> 5 4) es como haskell, 5 es el primer agumento y 4 el segundo

    (if(> 5 4)             ;; criterio
        (message "wow, 5 es mayor que 4!"))  ;; resultado si se cumple
  #+END_SRC

  #+RESULTS:
  : wow, 5 es mayor que 4!
*** Ejemplo 2 - Definiendo una función con un Condicional Compuesto y las funciones (equal) y (message)
  #+BEGIN_SRC elisp
    (defun tipo-animal (tipo)                      ;; defun nombre (lista-argumentos)
      "Imprime un mensaje segun el tipo de animal" ;; "documentación", breve descripción de la función
      (if (equal tipo 'fiera)                      ;; cuerpo parte-si
          (message "Cuidado! Corré!")              ;; cuerpo parte-then
          (message "No es peligroso")))            ;; cuerpo parte-else

    (tipo-animal 'fiera)
    (tipo-animal 'cebrita)
  #+END_SRC

  #+RESULTS:
  : No es peligroso
*** Ejemplo 2 - Lista de Constantes numéricas y Operadores como átomos
  #+BEGIN_SRC elisp :exports both
    '(+ 2 2)

    ; no confundir con la funcion (+ 2 2)
    ; el de arriba empieza con el apóstrofe, por tanto es una lista
  #+END_SRC

  #+RESULTS:
  | + | 2 | 2 |
*** Ejemplo 3 - Lista con saltos de linea
  #+BEGIN_SRC elisp :exports both
    '(rose
      violet
      daisy
      buttercup)
  #+END_SRC

  #+RESULTS:
  | rose | violet | daisy | buttercup |
*** Ejemplo 4 - Lista con espacios
  #+BEGIN_SRC elisp :exports both
    '(rose violet daisy buttercup)
  #+END_SRC

  #+RESULTS:
  | rose | violet | daisy | buttercup |
*** Ejemplo 5 - Lista con literales cadena cómo átomos
  #+BEGIN_SRC elisp :exports both
    '(esta lista tiene "un literal cadena" "otro string")
  #+END_SRC

  #+RESULTS:
  | esta | lista | tiene | un literal cadena | otro string |
